INSERT INTO dbo.Суддя([Код судді],[Прізвище],[Ім'я], [По-батькові],
[Телефонний номер],[Дата народження],[Стать],[Громадянство],[Суддівське звання]) 
VALUES ('5', 'Шевченко', 'Олексій', 'Михайлович', '951534423','1982-11-23', 'Ч', 'Україна', 'Заслужений суддя')


INSERT INTO dbo.Суддя([Код судді],[Прізвище],[Ім'я],
[По-батькові],[Телефонний номер],
[Дата народження],[Стать],[Громадянство],[Суддівське звання]) 
VALUES ('6', 'Дер', 'Штефан', NULL, '671232423','1980-01-12', 'Ч', 'Німеччина', 'Заслужений суддя'),
('7', 'Лоренц', 'Ельсініо', NULL, '433125843','1972-07-30', 'Ч', 'Франція', 'Старший суддя')


UPDATE dbo.Суддя
SET [Суддівське звання] = 'Недосвідчений суддя'
WHERE [Громадянство] = 'Франція';


DELETE FROM dbo.Суддя 
WHERE [Прізвище] = 'Лоренц';
