SELECT COUNT([Код спортсмена]) as Кількість_спортсменів 
from dbo.Спортсмен
WHERE [Код спортсмена]>2

SELECT  Прізвище, AVG([Код спортсмена]) as Звання from Спортсмен
GROUP BY Спортсмен.Прізвище
HAVING AVG([Код спортсмена])>3;

SELECT  STDEV ( Бюджет) as Середнє_квадратичне_відхилення_бюджету
from Олімпіада;

SELECT Олімпіада.Тип, SUM(Бюджет) as Бюджет 
FROM dbo.[Країна-господар]
INNER JOIN Олімпіада on [Країна-господар].[Код країни-господаря]=Олімпіада.[Код олімпіади] 
GROUP BY Олімпіада.Тип

SELECT MAX(Бюджет) 
as Максимум from Олімпіада
WHERE Олімпіада.Тип='Літня'
